{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "# ENES use case graph example\n",
    "* A graph is generated representing a server infrastructure providing different types of data services hosted by data servers\n",
    "* The data is organized in collections\n",
    "* Collections can be hosted by multiple servers (replication)\n",
    "* Servers provide different average bandwidth to different geographical regions"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Setup Connection to neo4j instance"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": false,
    "scrolled": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "import ENESNeoTools \n",
    "from py2neo import Graph, Node, Relationship, authenticate\n",
    "authenticate(\"localhost:7474\", ENESNeoTools.user_name, ENESNeoTools.pass_word)\n",
    "\n",
    "# connect to authenticated graph database\n",
    "graph = Graph(\"http://localhost:7474/db/data/\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "source": [
    "### also rest client possible"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "from neo4jrestclient.client import GraphDatabase\n",
    "from neo4jrestclient.query import Q\n",
    "gdb = GraphDatabase(\"http://localhost:7474/db/data/\",username=\"neo4j\",password=\"prolog16\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Set up a data collection graph \n",
    "* data is organized in collections\n",
    "* collections are hierarchically organized according to levels (file directory analogon)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "skip"
    }
   },
   "outputs": [],
   "source": [
    "# collection organization reflects directory structure:\n",
    "# e.g. cordex/output/EUR-11/MPI-CSC/MPI-M-MPI-ESM-LR/rcp85/r1i1p1/MPI-CSC-REMO2009/v1/day/tas\n",
    "# generic structure: <activity>/<product>/<Domain>/<Institution>/<GCMModelName>/<CMIP5ExperimentName>\n",
    "#           /<CMIP5EnsembleMember>/<RCMModelName>/<RCMVersionID>/<Frequency>/<VariableName>.\n",
    "\n",
    "# facets describing collection\n",
    "\n",
    "facet_nodes = []\n",
    "for key, value in ENESNeoTools.facet_list1.iteritems():\n",
    "    facet_node = Node(\"Collection\",name=value[1], level=value[0])\n",
    "    facet_nodes.append(facet_node)\n",
    "       \n",
    "facet_chain = []\n",
    "for i in range(1,len(facet_nodes)):\n",
    "    rel = Relationship(facet_nodes[i],\"belongs_to\",facet_nodes[i-1])\n",
    "    facet_chain.append(rel)\n",
    "        \n",
    "for rel in facet_chain:\n",
    "    graph.create(rel)\n",
    "\n",
    "cordex_file_set1 = ENESNeoTools.get_files(ENESNeoTools.facet_list1)\n",
    "\n",
    "#cordex_set1 = []\n",
    "cordex_rel1 = []\n",
    "\n",
    "for cordexfile in cordex_file_set1:\n",
    "    node = Node(\"File\", name=cordexfile, group=\"file\")\n",
    "   # cordex_set1.append(node)\n",
    "    cordex_rel1.append(Relationship(node,\"belongs_to\",facet_nodes[0]))\n",
    "                       \n",
    "for rel in cordex_rel1:    \n",
    "   graph.create(rel)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Data servers graph setup\n",
    "* servers and expose three types of data access services (http, globus, opendap)\n",
    "* services and servers can be non-operational (\"down\") \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false,
    "scrolled": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "server_list = ENESNeoTools.get_servers()\n",
    "\n",
    "\n",
    "service_rels = []\n",
    "server_nodes = []\n",
    "for (sname, surl) in server_list:\n",
    "    new_node = Node('data_server',name=sname, url=surl)\n",
    "   \n",
    "    server_nodes.append(new_node)\n",
    "    data_services = ENESNeoTools.data_service_nodes(sname)\n",
    "   \n",
    "    for data_service in data_services:\n",
    "          service_rels.append(Relationship(data_service,\"service\",new_node)) \n",
    "            \n",
    "for rel in service_rels:\n",
    "    graph.create(rel)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Combine data set graph with server graph\n",
    "* a data collection is \"served_by\" a data_server"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(<Relationship graph=u'http://localhost:7474/db/data/' ref=u'relationship/0' start=u'node/134' end=u'node/169' type=u'served_by' properties={}>,)"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "orig1 = Relationship(facet_nodes[1],\"served_by\",server_nodes[0])\n",
    "replica1 = Relationship(facet_nodes[1],\"served_by\",server_nodes[1])\n",
    "\n",
    "graph.create(orig1)\n",
    "graph.create(replica1)\n",
    " "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Data servers provide different bandwidth to different regions / countries and end users belong to different regions (temporarily)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(<Relationship graph=u'http://localhost:7474/db/data/' ref=u'relationship/1' start=u'node/165' end=u'node/3' type=u'nw_link' properties={'bandwidth': 2000000}>,\n",
       " <Relationship graph=u'http://localhost:7474/db/data/' ref=u'relationship/2' start=u'node/165' end=u'node/4' type=u'nw_link' properties={'bandwidth': 1000000}>,\n",
       " <Relationship graph=u'http://localhost:7474/db/data/' ref=u'relationship/3' start=u'node/165' end=u'node/5' type=u'nw_link' properties={'bandwidth': 500000}>,\n",
       " <Relationship graph=u'http://localhost:7474/db/data/' ref=u'relationship/4' start=u'node/169' end=u'node/3' type=u'nw_link' properties={'bandwidth': 1500000}>,\n",
       " <Relationship graph=u'http://localhost:7474/db/data/' ref=u'relationship/5' start=u'node/169' end=u'node/4' type=u'nw_link' properties={'bandwidth': 3000000}>,\n",
       " <Relationship graph=u'http://localhost:7474/db/data/' ref=u'relationship/6' start=u'node/169' end=u'node/5' type=u'nw_link' properties={'bandwidth': 400000}>)"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "region_germany = Node(\"country\", name=\"Germany\", provider=\"DFN\")\n",
    "region_australia = Node(\"country\", name=\"Australia\", provider=\"RNet\")\n",
    "region_sweden = Node(\"country\", name=\"Sweden\", provider=\"SweNet\")\n",
    "\n",
    "user1 = Node(\"user\",name=\"Stephan Kindermann\")\n",
    "user2 =  Node(\"user\",name=\"Mr Spock\")\n",
    "user3 = Node(\"user\",name=\"Michael Kolax\")\n",
    "\n",
    "home1 = Relationship(user1,\"connects_to\",region_germany)\n",
    "home2 = Relationship(user2,\"connects_to\",region_australia)\n",
    "home3 = Relationship(user3,\"connects_to\",region_sweden)\n",
    "\n",
    "link1 = Relationship(server_nodes[0],\"nw_link\",region_germany,  bandwidth=2000000)\n",
    "link2 = Relationship(server_nodes[0],\"nw_link\",region_sweden,   bandwidth=1000000)\n",
    "link3 = Relationship(server_nodes[0],\"nw_link\",region_australia,bandwidth=500000)\n",
    "\n",
    "link4 = Relationship(server_nodes[1],\"nw_link\",region_germany,   bandwidth=1500000)\n",
    "link5 = Relationship(server_nodes[1],\"nw_link\",region_sweden,    bandwidth=3000000)\n",
    "link6 = Relationship(server_nodes[1],\"nw_link\",region_australia, bandwidth=400000)\n",
    "\n",
    "graph.create(link1,link2,link3,link4,link5,link6)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## Data servers are sometimes down (not operational and thus do not serve data to users)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'name': u'carbon.dkrz', 'status': u'UP', 'url': u'http://carbon.dkrz.de'}"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "server_nodes[0].properties[\"status\"] = \"UP\"\n",
    "server_nodes[1].properties[\"status\"] = \"UP\"\n",
    "server_nodes[0].push()\n",
    "server_nodes[1].push()\n",
    "server_nodes[0].properties\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "***\n",
    "***\n",
    "# Interactive cells to play with graph\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<iframe src=http://localhost:7474/browser/ width=1000 height=800> </iframe>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from IPython.display import HTML\n",
    "HTML('<iframe src=http://localhost:7474/browser/ width=1000 height=800> </iframe>')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "skip"
    }
   },
   "outputs": [],
   "source": [
    "%load_ext cypher "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | myfile                                                                                                                 \n",
       "---+-------------------------------------------------------------------------------------------------------------------------\n",
       " 1 | (n157:File {group:\"file\",name:\"tas_EUR-11_MPI-M-MPI-ESM-LR_rcp85_r1i1p1_MPI-CSC-REMO2009_v1_day_20660101-20701231.nc\"})"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "statement = \"\"\"MATCH (myfile:File {name:\"tas_EUR-11_MPI-M-MPI-ESM-LR_rcp85_r1i1p1_MPI-CSC-REMO2009_v1_day_20660101-20701231.nc\"}) RETURN myfile\"\"\"\n",
    "results = graph.cypher.execute(statement)\n",
    "results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>myfile</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>{u'group': u'file', u'name': u'tas_EUR-11_MPI-...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              myfile\n",
       "0  {u'group': u'file', u'name': u'tas_EUR-11_MPI-..."
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher http://neo4j:prolog16@localhost:7474/db/data MATCH (myfile:File {name:\"tas_EUR-11_MPI-M-MPI-ESM-LR_rcp85_r1i1p1_MPI-CSC-REMO2009_v1_day_20660101-20701231.nc\"}) RETURN myfile\n",
    "results.get_dataframe()            "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "skip"
    }
   },
   "outputs": [],
   "source": [
    "graph.open_browser()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## return operational servers for a specific file "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{u'url': u'http://cordex.shmhi.se', u'status': u'UP', u'name': u'cordex.smhi'}</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{u'url': u'http://carbon.dkrz.de', u'status': u'UP', u'name': u'carbon.dkrz'}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{u'name': u'cordex.smhi',\n",
       "   u'status': u'UP',\n",
       "   u'url': u'http://cordex.shmhi.se'}],\n",
       " [{u'name': u'carbon.dkrz',\n",
       "   u'status': u'UP',\n",
       "   u'url': u'http://carbon.dkrz.de'}]]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:prolog16@localhost:7474/db/data\n",
    "\n",
    "MATCH (a:File)-[:belongs_to*]-(b:Collection) -[:served_by]- (c:data_server)  \n",
    "WHERE c.status = 'UP' AND a.name = 'tas_EUR-11_MPI-M-MPI-ESM-LR_rcp85_r1i1p1_MPI-CSC-REMO2009_v1_day_20760101-20801231.nc'\n",
    "RETURN c"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "## switch off a server and rerun query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "server_nodes[1].properties[\"status\"] = \"DOWN\"\n",
    "server_nodes[1].push()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{u'url': u'http://carbon.dkrz.de', u'status': u'UP', u'name': u'carbon.dkrz'}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{u'name': u'carbon.dkrz',\n",
       "   u'status': u'UP',\n",
       "   u'url': u'http://carbon.dkrz.de'}]]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher  http://neo4j:prolog16@localhost:7474/db/data\n",
    "\n",
    "MATCH (a:File)-[:belongs_to*]-(b:Collection) -[:served_by]- (c:data_server)  \n",
    "WHERE c.status = 'UP' AND a.name = 'tas_EUR-11_MPI-M-MPI-ESM-LR_rcp85_r1i1p1_MPI-CSC-REMO2009_v1_day_20760101-20801231.nc'\n",
    "RETURN c"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "results = %cypher http://neo4j:prolog16@localhost:7474/db/data MATCH (a)-[r]-(b) RETURN a,r, b"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "%%bash\n",
    "ls"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Simple cells to clean graphdb "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:prolog16@localhost:7474/db/data\n",
    "\n",
    "MATCH (n)\n",
    "OPTIONAL MATCH (n)-[r]-()\n",
    "DELETE n,r"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## simple graph visualizations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "%matplotlib inline\n",
    "results.get_graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "results.draw()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "# ToDo / Ideas"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "## Add data server access log information (e.g.) users who downloaded - also downloaded \n",
    "## .. number of downloads of specific data sets etc. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
